Kakakacarrotcake/bazel_toolchain_atmega/mplab_xc8_compiler/v3.00/pic/include/proc/pic16f18156.h
// Register: DAC2DATL
#define DAC2DATL DAC2DATL
extern volatile unsigned char           DAC2DATL            __at(0x891);
#ifndef _LIB_BUILD
asm("DAC2DATL equ 0891h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DAC2R                  :8;
    };
    struct {
        unsigned DAT                    :8;
    };
} DAC2DATLbits_t;
extern volatile DAC2DATLbits_t DAC2DATLbits __at(0x891);
// bitfield macros
#define _DAC2DATL_DAC2R_POSN                                0x0
#define _DAC2DATL_DAC2R_POSITION                            0x0
#define _DAC2DATL_DAC2R_SIZE                                0x8
#define _DAC2DATL_DAC2R_LENGTH                              0x8
#define _DAC2DATL_DAC2R_MASK                                0xFF
#define _DAC2DATL_DAT_POSN                                  0x0
#define _DAC2DATL_DAT_POSITION                              0x0
#define _DAC2DATL_DAT_SIZE                                  0x8
#define _DAC2DATL_DAT_LENGTH                                0x8
#define _DAC2DATL_DAT_MASK                                  0xFF

// Register: PWM3ERS
#define PWM3ERS PWM3ERS
extern volatile unsigned char           PWM3ERS             __at(0x98C);
#ifndef _LIB_BUILD
asm("PWM3ERS equ 098Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ERS                    :8;
    };
    struct {
        unsigned ERS0                   :1;
        unsigned ERS1                   :1;
        unsigned ERS2                   :1;
        unsigned ERS3                   :1;
    };
} PWM3ERSbits_t;
extern volatile PWM3ERSbits_t PWM3ERSbits __at(0x98C);
// bitfield macros
#define _PWM3ERS_ERS_POSN                                   0x0
#define _PWM3ERS_ERS_POSITION                               0x0
#define _PWM3ERS_ERS_SIZE                                   0x8
#define _PWM3ERS_ERS_LENGTH                                 0x8
#define _PWM3ERS_ERS_MASK                                   0xFF
#define _PWM3ERS_ERS0_POSN                                  0x0
#define _PWM3ERS_ERS0_POSITION                              0x0
#define _PWM3ERS_ERS0_SIZE                                  0x1
#define _PWM3ERS_ERS0_LENGTH                                0x1
#define _PWM3ERS_ERS0_MASK                                  0x1
#define _PWM3ERS_ERS1_POSN                                  0x1
#define _PWM3ERS_ERS1_POSITION                              0x1
#define _PWM3ERS_ERS1_SIZE                                  0x1
#define _PWM3ERS_ERS1_LENGTH                                0x1
#define _PWM3ERS_ERS1_MASK                                  0x2
#define _PWM3ERS_ERS2_POSN                                  0x2
#define _PWM3ERS_ERS2_POSITION                              0x2
#define _PWM3ERS_ERS2_SIZE                                  0x1
#define _PWM3ERS_ERS2_LENGTH                                0x1
#define _PWM3ERS_ERS2_MASK                                  0x4
#define _PWM3ERS_ERS3_POSN                                  0x3
#define _PWM3ERS_ERS3_POSITION                              0x3
#define _PWM3ERS_ERS3_SIZE                                  0x1
#define _PWM3ERS_ERS3_LENGTH                                0x1
#define _PWM3ERS_ERS3_MASK                                  0x8

// Register: PWM3CLK
#define PWM3CLK PWM3CLK
extern volatile unsigned char           PWM3CLK             __at(0x98D);
#ifndef _LIB_BUILD
asm("PWM3CLK equ 098Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLK                    :8;
    };
    struct {
        unsigned CLK0                   :1;
        unsigned CLK1                   :1;
        unsigned CLK2                   :1;
        unsigned CLK3                   :1;
    };
} PWM3CLKbits_t;
extern volatile PWM3CLKbits_t PWM3CLKbits __at(0x98D);
// bitfield macros
#define _PWM3CLK_CLK_POSN                                   0x0
#define _PWM3CLK_CLK_POSITION                               0x0
#define _PWM3CLK_CLK_SIZE                                   0x8
#define _PWM3CLK_CLK_LENGTH                                 0x8
#define _PWM3CLK_CLK_MASK                                   0xFF
#define _PWM3CLK_CLK0_POSN                                  0x0
#define _PWM3CLK_CLK0_POSITION                              0x0
#define _PWM3CLK_CLK0_SIZE                                  0x1
#define _PWM3CLK_CLK0_LENGTH                                0x1
#define _PWM3CLK_CLK0_MASK                                  0x1
#define _PWM3CLK_CLK1_POSN                                  0x1
#define _PWM3CLK_CLK1_POSITION                              0x1
#define _PWM3CLK_CLK1_SIZE                                  0x1
#define _PWM3CLK_CLK1_LENGTH                                0x1
#define _PWM3CLK_CLK1_MASK                                  0x2
#define _PWM3CLK_CLK2_POSN                                  0x2
#define _PWM3CLK_CLK2_POSITION                              0x2
#define _PWM3CLK_CLK2_SIZE                                  0x1
#define _PWM3CLK_CLK2_LENGTH                                0x1
#define _PWM3CLK_CLK2_MASK                                  0x4
#define _PWM3CLK_CLK3_POSN                                  0x3
#define _PWM3CLK_CLK3_POSITION                              0x3
#define _PWM3CLK_CLK3_SIZE                                  0x1
#define _PWM3CLK_CLK3_LENGTH                                0x1
#define _PWM3CLK_CLK3_MASK                                  0x8

// Register: PWM3LDS
#define PWM3LDS PWM3LDS
extern volatile unsigned char           PWM3LDS             __at(0x98E);
#ifndef _LIB_BUILD
asm("PWM3LDS equ 098Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LDS                    :8;
    };
    struct {
        unsigned LDS0                   :1;
        unsigned LDS1                   :1;
        unsigned LDS2                   :1;
    };
} PWM3LDSbits_t;
extern volatile PWM3LDSbits_t PWM3LDSbits __at(0x98E);
// bitfield macros
#define _PWM3LDS_LDS_POSN                                   0x0
#define _PWM3LDS_LDS_POSITION                               0x0
#define _PWM3LDS_LDS_SIZE                                   0x8
#define _PWM3LDS_LDS_LENGTH                                 0x8
#define _PWM3LDS_LDS_MASK                                   0xFF
#define _PWM3LDS_LDS0_POSN                                  0x0
#define _PWM3LDS_LDS0_POSITION                              0x0
#define _PWM3LDS_LDS0_SIZE                                  0x1
#define _PWM3LDS_LDS0_LENGTH                                0x1
#define _PWM3LDS_LDS0_MASK                                  0x1
#define _PWM3LDS_LDS1_POSN                                  0x1
#define _PWM3LDS_LDS1_POSITION                              0x1
#define _PWM3LDS_LDS1_SIZE                                  0x1
#define _PWM3LDS_LDS1_LENGTH                                0x1
#define _PWM3LDS_LDS1_MASK                                  0x2
#define _PWM3LDS_LDS2_POSN                                  0x2
#define _PWM3LDS_LDS2_POSITION                              0x2
#define _PWM3LDS_LDS2_SIZE                                  0x1
#define _PWM3LDS_LDS2_LENGTH                                0x1
#define _PWM3LDS_LDS2_MASK                                  0x4

// Register: PWM3PR
#define PWM3PR PWM3PR
extern volatile unsigned short          PWM3PR              __at(0x98F);
#ifndef _LIB_BUILD
asm("PWM3PR equ 098Fh");
#endif

