Kakakacarrotcake/bazel_toolchain_atmega/mplab_xc8_compiler/v3.00/pic/include/proc/pic16f18156.h
// Register: PWM3S1P2
#define PWM3S1P2 PWM3S1P2
extern volatile unsigned short          PWM3S1P2            __at(0x999);
#ifndef _LIB_BUILD
asm("PWM3S1P2 equ 0999h");
#endif

// Register: PWM3S1P2L
#define PWM3S1P2L PWM3S1P2L
extern volatile unsigned char           PWM3S1P2L           __at(0x999);
#ifndef _LIB_BUILD
asm("PWM3S1P2L equ 0999h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P2L                    :8;
    };
    struct {
        unsigned S1P2L                  :8;
    };
} PWM3S1P2Lbits_t;
extern volatile PWM3S1P2Lbits_t PWM3S1P2Lbits __at(0x999);
// bitfield macros
#define _PWM3S1P2L_P2L_POSN                                 0x0
#define _PWM3S1P2L_P2L_POSITION                             0x0
#define _PWM3S1P2L_P2L_SIZE                                 0x8
#define _PWM3S1P2L_P2L_LENGTH                               0x8
#define _PWM3S1P2L_P2L_MASK                                 0xFF
#define _PWM3S1P2L_S1P2L_POSN                               0x0
#define _PWM3S1P2L_S1P2L_POSITION                           0x0
#define _PWM3S1P2L_S1P2L_SIZE                               0x8
#define _PWM3S1P2L_S1P2L_LENGTH                             0x8
#define _PWM3S1P2L_S1P2L_MASK                               0xFF

// Register: PWM3S1P2H
#define PWM3S1P2H PWM3S1P2H
extern volatile unsigned char           PWM3S1P2H           __at(0x99A);
#ifndef _LIB_BUILD
asm("PWM3S1P2H equ 099Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P2H                    :8;
    };
    struct {
        unsigned S1P2H                  :8;
    };
} PWM3S1P2Hbits_t;
extern volatile PWM3S1P2Hbits_t PWM3S1P2Hbits __at(0x99A);
// bitfield macros
#define _PWM3S1P2H_P2H_POSN                                 0x0
#define _PWM3S1P2H_P2H_POSITION                             0x0
#define _PWM3S1P2H_P2H_SIZE                                 0x8
#define _PWM3S1P2H_P2H_LENGTH                               0x8
#define _PWM3S1P2H_P2H_MASK                                 0xFF
#define _PWM3S1P2H_S1P2H_POSN                               0x0
#define _PWM3S1P2H_S1P2H_POSITION                           0x0
#define _PWM3S1P2H_S1P2H_SIZE                               0x8
#define _PWM3S1P2H_S1P2H_LENGTH                             0x8
#define _PWM3S1P2H_S1P2H_MASK                               0xFF

// Register: PWM4ERS
#define PWM4ERS PWM4ERS
extern volatile unsigned char           PWM4ERS             __at(0xA0C);
#ifndef _LIB_BUILD
asm("PWM4ERS equ 0A0Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ERS                    :8;
    };
    struct {
        unsigned ERS0                   :1;
        unsigned ERS1                   :1;
        unsigned ERS2                   :1;
        unsigned ERS3                   :1;
    };
} PWM4ERSbits_t;
extern volatile PWM4ERSbits_t PWM4ERSbits __at(0xA0C);
// bitfield macros
#define _PWM4ERS_ERS_POSN                                   0x0
#define _PWM4ERS_ERS_POSITION                               0x0
#define _PWM4ERS_ERS_SIZE                                   0x8
#define _PWM4ERS_ERS_LENGTH                                 0x8
#define _PWM4ERS_ERS_MASK                                   0xFF
#define _PWM4ERS_ERS0_POSN                                  0x0
#define _PWM4ERS_ERS0_POSITION                              0x0
#define _PWM4ERS_ERS0_SIZE                                  0x1
#define _PWM4ERS_ERS0_LENGTH                                0x1
#define _PWM4ERS_ERS0_MASK                                  0x1
#define _PWM4ERS_ERS1_POSN                                  0x1
#define _PWM4ERS_ERS1_POSITION                              0x1
#define _PWM4ERS_ERS1_SIZE                                  0x1
#define _PWM4ERS_ERS1_LENGTH                                0x1
#define _PWM4ERS_ERS1_MASK                                  0x2
#define _PWM4ERS_ERS2_POSN                                  0x2
#define _PWM4ERS_ERS2_POSITION                              0x2
#define _PWM4ERS_ERS2_SIZE                                  0x1
#define _PWM4ERS_ERS2_LENGTH                                0x1
#define _PWM4ERS_ERS2_MASK                                  0x4
#define _PWM4ERS_ERS3_POSN                                  0x3
#define _PWM4ERS_ERS3_POSITION                              0x3
#define _PWM4ERS_ERS3_SIZE                                  0x1
#define _PWM4ERS_ERS3_LENGTH                                0x1
#define _PWM4ERS_ERS3_MASK                                  0x8

// Register: PWM4CLK
#define PWM4CLK PWM4CLK
extern volatile unsigned char           PWM4CLK             __at(0xA0D);
#ifndef _LIB_BUILD
asm("PWM4CLK equ 0A0Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLK                    :8;
    };
    struct {
        unsigned CLK0                   :1;
        unsigned CLK1                   :1;
        unsigned CLK2                   :1;
        unsigned CLK3                   :1;
    };
} PWM4CLKbits_t;
extern volatile PWM4CLKbits_t PWM4CLKbits __at(0xA0D);
// bitfield macros
#define _PWM4CLK_CLK_POSN                                   0x0
#define _PWM4CLK_CLK_POSITION                               0x0
#define _PWM4CLK_CLK_SIZE                                   0x8
#define _PWM4CLK_CLK_LENGTH                                 0x8
#define _PWM4CLK_CLK_MASK                                   0xFF
#define _PWM4CLK_CLK0_POSN                                  0x0
#define _PWM4CLK_CLK0_POSITION                              0x0
#define _PWM4CLK_CLK0_SIZE                                  0x1
#define _PWM4CLK_CLK0_LENGTH                                0x1
#define _PWM4CLK_CLK0_MASK                                  0x1
#define _PWM4CLK_CLK1_POSN                                  0x1
#define _PWM4CLK_CLK1_POSITION                              0x1
#define _PWM4CLK_CLK1_SIZE                                  0x1
#define _PWM4CLK_CLK1_LENGTH                                0x1
#define _PWM4CLK_CLK1_MASK                                  0x2
#define _PWM4CLK_CLK2_POSN                                  0x2
#define _PWM4CLK_CLK2_POSITION                              0x2
#define _PWM4CLK_CLK2_SIZE                                  0x1
#define _PWM4CLK_CLK2_LENGTH                                0x1
#define _PWM4CLK_CLK2_MASK                                  0x4
#define _PWM4CLK_CLK3_POSN                                  0x3
#define _PWM4CLK_CLK3_POSITION                              0x3
#define _PWM4CLK_CLK3_SIZE                                  0x1
#define _PWM4CLK_CLK3_LENGTH                                0x1
#define _PWM4CLK_CLK3_MASK                                  0x8

// Register: PWM4LDS
#define PWM4LDS PWM4LDS
extern volatile unsigned char           PWM4LDS             __at(0xA0E);
#ifndef _LIB_BUILD
asm("PWM4LDS equ 0A0Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned LDS                    :8;
    };
    struct {
        unsigned LDS0                   :1;
        unsigned LDS1                   :1;
        unsigned LDS2                   :1;
    };
} PWM4LDSbits_t;
extern volatile PWM4LDSbits_t PWM4LDSbits __at(0xA0E);
// bitfield macros
#define _PWM4LDS_LDS_POSN                                   0x0
#define _PWM4LDS_LDS_POSITION                               0x0
#define _PWM4LDS_LDS_SIZE                                   0x8
#define _PWM4LDS_LDS_LENGTH                                 0x8
#define _PWM4LDS_LDS_MASK                                   0xFF
#define _PWM4LDS_LDS0_POSN                                  0x0
#define _PWM4LDS_LDS0_POSITION                              0x0
#define _PWM4LDS_LDS0_SIZE                                  0x1
#define _PWM4LDS_LDS0_LENGTH                                0x1
#define _PWM4LDS_LDS0_MASK                                  0x1
#define _PWM4LDS_LDS1_POSN                                  0x1
#define _PWM4LDS_LDS1_POSITION                              0x1
#define _PWM4LDS_LDS1_SIZE                                  0x1
#define _PWM4LDS_LDS1_LENGTH                                0x1
#define _PWM4LDS_LDS1_MASK                                  0x2
#define _PWM4LDS_LDS2_POSN                                  0x2
#define _PWM4LDS_LDS2_POSITION                              0x2
#define _PWM4LDS_LDS2_SIZE                                  0x1
#define _PWM4LDS_LDS2_LENGTH                                0x1
#define _PWM4LDS_LDS2_MASK                                  0x4

