Kakakacarrotcake/bazel_toolchain_atmega/mplab_xc8_compiler/v3.00/pic/include/proc/pic16f18156.h
extern volatile __bit                   CWG1LD              __at(0x3086);	// @ (0x610 * 8 + 6)
#define                                 CWG1LD_bit          _BIT_ACCESS(CWG1CON0,6)
// CWG1AS0<CWG1LSAC0>
extern volatile __bit                   CWG1LSAC0           __at(0x3092);	// @ (0x612 * 8 + 2)
#define                                 CWG1LSAC0_bit       _BIT_ACCESS(CWG1AS0,2)
// CWG1AS0<CWG1LSAC1>
extern volatile __bit                   CWG1LSAC1           __at(0x3093);	// @ (0x612 * 8 + 3)
#define                                 CWG1LSAC1_bit       _BIT_ACCESS(CWG1AS0,3)
// CWG1AS0<CWG1LSBD0>
extern volatile __bit                   CWG1LSBD0           __at(0x3094);	// @ (0x612 * 8 + 4)
#define                                 CWG1LSBD0_bit       _BIT_ACCESS(CWG1AS0,4)
// CWG1AS0<CWG1LSBD1>
extern volatile __bit                   CWG1LSBD1           __at(0x3095);	// @ (0x612 * 8 + 5)
#define                                 CWG1LSBD1_bit       _BIT_ACCESS(CWG1AS0,5)
// PMD2<CWG1MD>
extern volatile __bit                   CWG1MD              __at(0x874);	// @ (0x10E * 8 + 4)
#define                                 CWG1MD_bit          _BIT_ACCESS(PMD2,4)
// CWG1CON0<CWG1MODE0>
extern volatile __bit                   CWG1MODE0           __at(0x3080);	// @ (0x610 * 8 + 0)
#define                                 CWG1MODE0_bit       _BIT_ACCESS(CWG1CON0,0)
// CWG1CON0<CWG1MODE1>
extern volatile __bit                   CWG1MODE1           __at(0x3081);	// @ (0x610 * 8 + 1)
#define                                 CWG1MODE1_bit       _BIT_ACCESS(CWG1CON0,1)
// CWG1CON0<CWG1MODE2>
extern volatile __bit                   CWG1MODE2           __at(0x3082);	// @ (0x610 * 8 + 2)
#define                                 CWG1MODE2_bit       _BIT_ACCESS(CWG1CON0,2)
// CWG1STR<CWG1OVRA>
extern volatile __bit                   CWG1OVRA            __at(0x30A4);	// @ (0x614 * 8 + 4)
#define                                 CWG1OVRA_bit        _BIT_ACCESS(CWG1STR,4)
// CWG1STR<CWG1OVRB>
extern volatile __bit                   CWG1OVRB            __at(0x30A5);	// @ (0x614 * 8 + 5)
#define                                 CWG1OVRB_bit        _BIT_ACCESS(CWG1STR,5)
// CWG1STR<CWG1OVRC>
extern volatile __bit                   CWG1OVRC            __at(0x30A6);	// @ (0x614 * 8 + 6)
#define                                 CWG1OVRC_bit        _BIT_ACCESS(CWG1STR,6)
// CWG1STR<CWG1OVRD>
extern volatile __bit                   CWG1OVRD            __at(0x30A7);	// @ (0x614 * 8 + 7)
#define                                 CWG1OVRD_bit        _BIT_ACCESS(CWG1STR,7)
// CWG1CON1<CWG1POLA>
extern volatile __bit                   CWG1POLA            __at(0x3088);	// @ (0x611 * 8 + 0)
#define                                 CWG1POLA_bit        _BIT_ACCESS(CWG1CON1,0)
// CWG1CON1<CWG1POLB>
extern volatile __bit                   CWG1POLB            __at(0x3089);	// @ (0x611 * 8 + 1)
#define                                 CWG1POLB_bit        _BIT_ACCESS(CWG1CON1,1)
// CWG1CON1<CWG1POLC>
extern volatile __bit                   CWG1POLC            __at(0x308A);	// @ (0x611 * 8 + 2)
#define                                 CWG1POLC_bit        _BIT_ACCESS(CWG1CON1,2)
// CWG1CON1<CWG1POLD>
extern volatile __bit                   CWG1POLD            __at(0x308B);	// @ (0x611 * 8 + 3)
#define                                 CWG1POLD_bit        _BIT_ACCESS(CWG1CON1,3)
// CWG1PPS<CWG1PPS0>
extern volatile __bit                   CWG1PPS0            __at(0xF1C8);	// @ (0x1E39 * 8 + 0)
#define                                 CWG1PPS0_bit        _BIT_ACCESS(CWG1PPS,0)
// CWG1PPS<CWG1PPS1>
extern volatile __bit                   CWG1PPS1            __at(0xF1C9);	// @ (0x1E39 * 8 + 1)
#define                                 CWG1PPS1_bit        _BIT_ACCESS(CWG1PPS,1)
// CWG1PPS<CWG1PPS2>
extern volatile __bit                   CWG1PPS2            __at(0xF1CA);	// @ (0x1E39 * 8 + 2)
#define                                 CWG1PPS2_bit        _BIT_ACCESS(CWG1PPS,2)
// CWG1PPS<CWG1PPS3>
extern volatile __bit                   CWG1PPS3            __at(0xF1CB);	// @ (0x1E39 * 8 + 3)
#define                                 CWG1PPS3_bit        _BIT_ACCESS(CWG1PPS,3)
// CWG1PPS<CWG1PPS4>
extern volatile __bit                   CWG1PPS4            __at(0xF1CC);	// @ (0x1E39 * 8 + 4)
#define                                 CWG1PPS4_bit        _BIT_ACCESS(CWG1PPS,4)
// CWG1PPS<CWG1PPS5>
extern volatile __bit                   CWG1PPS5            __at(0xF1CD);	// @ (0x1E39 * 8 + 5)
#define                                 CWG1PPS5_bit        _BIT_ACCESS(CWG1PPS,5)
// CWG1STR<CWG1STRA>
extern volatile __bit                   CWG1STRA            __at(0x30A0);	// @ (0x614 * 8 + 0)
#define                                 CWG1STRA_bit        _BIT_ACCESS(CWG1STR,0)
// CWG1STR<CWG1STRB>
extern volatile __bit                   CWG1STRB            __at(0x30A1);	// @ (0x614 * 8 + 1)
#define                                 CWG1STRB_bit        _BIT_ACCESS(CWG1STR,1)
// CWG1STR<CWG1STRC>
extern volatile __bit                   CWG1STRC            __at(0x30A2);	// @ (0x614 * 8 + 2)
#define                                 CWG1STRC_bit        _BIT_ACCESS(CWG1STR,2)
// CWG1STR<CWG1STRD>
extern volatile __bit                   CWG1STRD            __at(0x30A3);	// @ (0x614 * 8 + 3)
#define                                 CWG1STRD_bit        _BIT_ACCESS(CWG1STR,3)
// CLCnSEL0<D1S0>
extern volatile __bit                   D1S0                __at(0x3470);	// @ (0x68E * 8 + 0)
#define                                 D1S0_bit            _BIT_ACCESS(CLCnSEL0,0)
// CLCnSEL0<D1S1>
extern volatile __bit                   D1S1                __at(0x3471);	// @ (0x68E * 8 + 1)
#define                                 D1S1_bit            _BIT_ACCESS(CLCnSEL0,1)
// CLCnSEL0<D1S2>
extern volatile __bit                   D1S2                __at(0x3472);	// @ (0x68E * 8 + 2)
#define                                 D1S2_bit            _BIT_ACCESS(CLCnSEL0,2)
// CLCnSEL0<D1S3>
extern volatile __bit                   D1S3                __at(0x3473);	// @ (0x68E * 8 + 3)
#define                                 D1S3_bit            _BIT_ACCESS(CLCnSEL0,3)
// CLCnSEL0<D1S4>
extern volatile __bit                   D1S4                __at(0x3474);	// @ (0x68E * 8 + 4)
#define                                 D1S4_bit            _BIT_ACCESS(CLCnSEL0,4)
// CLCnSEL0<D1S5>
extern volatile __bit                   D1S5                __at(0x3475);	// @ (0x68E * 8 + 5)
#define                                 D1S5_bit            _BIT_ACCESS(CLCnSEL0,5)
// CLCnSEL0<D1S6>
extern volatile __bit                   D1S6                __at(0x3476);	// @ (0x68E * 8 + 6)
#define                                 D1S6_bit            _BIT_ACCESS(CLCnSEL0,6)
// CLCnSEL1<D2S0>
extern volatile __bit                   D2S0                __at(0x3478);	// @ (0x68F * 8 + 0)
#define                                 D2S0_bit            _BIT_ACCESS(CLCnSEL1,0)
// CLCnSEL1<D2S1>
extern volatile __bit                   D2S1                __at(0x3479);	// @ (0x68F * 8 + 1)
#define                                 D2S1_bit            _BIT_ACCESS(CLCnSEL1,1)
// CLCnSEL1<D2S2>
extern volatile __bit                   D2S2                __at(0x347A);	// @ (0x68F * 8 + 2)
#define                                 D2S2_bit            _BIT_ACCESS(CLCnSEL1,2)
// CLCnSEL1<D2S3>
extern volatile __bit                   D2S3                __at(0x347B);	// @ (0x68F * 8 + 3)
#define                                 D2S3_bit            _BIT_ACCESS(CLCnSEL1,3)
// CLCnSEL1<D2S4>
extern volatile __bit                   D2S4                __at(0x347C);	// @ (0x68F * 8 + 4)
#define                                 D2S4_bit            _BIT_ACCESS(CLCnSEL1,4)
// CLCnSEL1<D2S5>
extern volatile __bit                   D2S5                __at(0x347D);	// @ (0x68F * 8 + 5)
#define                                 D2S5_bit            _BIT_ACCESS(CLCnSEL1,5)
// CLCnSEL1<D2S6>
extern volatile __bit                   D2S6                __at(0x347E);	// @ (0x68F * 8 + 6)
#define                                 D2S6_bit            _BIT_ACCESS(CLCnSEL1,6)
// CLCnSEL2<D3S0>
extern volatile __bit                   D3S0                __at(0x3480);	// @ (0x690 * 8 + 0)
#define                                 D3S0_bit            _BIT_ACCESS(CLCnSEL2,0)
// CLCnSEL2<D3S1>
extern volatile __bit                   D3S1                __at(0x3481);	// @ (0x690 * 8 + 1)
#define                                 D3S1_bit            _BIT_ACCESS(CLCnSEL2,1)
// CLCnSEL2<D3S2>
extern volatile __bit                   D3S2                __at(0x3482);	// @ (0x690 * 8 + 2)
#define                                 D3S2_bit            _BIT_ACCESS(CLCnSEL2,2)
// CLCnSEL2<D3S3>
extern volatile __bit                   D3S3                __at(0x3483);	// @ (0x690 * 8 + 3)
#define                                 D3S3_bit            _BIT_ACCESS(CLCnSEL2,3)
// CLCnSEL2<D3S4>
extern volatile __bit                   D3S4                __at(0x3484);	// @ (0x690 * 8 + 4)
#define                                 D3S4_bit            _BIT_ACCESS(CLCnSEL2,4)
// CLCnSEL2<D3S5>
extern volatile __bit                   D3S5                __at(0x3485);	// @ (0x690 * 8 + 5)
#define                                 D3S5_bit            _BIT_ACCESS(CLCnSEL2,5)
// CLCnSEL2<D3S6>
extern volatile __bit                   D3S6                __at(0x3486);	// @ (0x690 * 8 + 6)
#define                                 D3S6_bit            _BIT_ACCESS(CLCnSEL2,6)
// CLCnSEL3<D4S0>
extern volatile __bit                   D4S0                __at(0x3488);	// @ (0x691 * 8 + 0)
#define                                 D4S0_bit            _BIT_ACCESS(CLCnSEL3,0)
// CLCnSEL3<D4S1>
extern volatile __bit                   D4S1                __at(0x3489);	// @ (0x691 * 8 + 1)
#define                                 D4S1_bit            _BIT_ACCESS(CLCnSEL3,1)
// CLCnSEL3<D4S2>
extern volatile __bit                   D4S2                __at(0x348A);	// @ (0x691 * 8 + 2)
#define                                 D4S2_bit            _BIT_ACCESS(CLCnSEL3,2)
// CLCnSEL3<D4S3>
extern volatile __bit                   D4S3                __at(0x348B);	// @ (0x691 * 8 + 3)
#define                                 D4S3_bit            _BIT_ACCESS(CLCnSEL3,3)
// CLCnSEL3<D4S4>
extern volatile __bit                   D4S4                __at(0x348C);	// @ (0x691 * 8 + 4)
#define                                 D4S4_bit            _BIT_ACCESS(CLCnSEL3,4)
// CLCnSEL3<D4S5>
extern volatile __bit                   D4S5                __at(0x348D);	// @ (0x691 * 8 + 5)
#define                                 D4S5_bit            _BIT_ACCESS(CLCnSEL3,5)
// CLCnSEL3<D4S6>
extern volatile __bit                   D4S6                __at(0x348E);	// @ (0x691 * 8 + 6)
#define                                 D4S6_bit            _BIT_ACCESS(CLCnSEL3,6)
// SSP1STAT<DA1>
extern volatile __bit                   DA1                 __at(0x3C7D);	// @ (0x78F * 8 + 5)
#define                                 DA1_bit             _BIT_ACCESS(SSP1STAT,5)
// SSP2STAT<DA2>
extern volatile __bit                   DA2                 __at(0x3CCD);	// @ (0x799 * 8 + 5)
#define                                 DA2_bit             _BIT_ACCESS(SSP2STAT,5)
// SCANCON0<DABORT>
extern volatile __bit                   DABORT              __at(0xE4C4);	// @ (0x1C98 * 8 + 4)
#define                                 DABORT_bit          _BIT_ACCESS(SCANCON0,4)
// PMD4<DAC1MD>
extern volatile __bit                   DAC1MD              __at(0x881);	// @ (0x110 * 8 + 1)
#define                                 DAC1MD_bit          _BIT_ACCESS(PMD4,1)
// PMD4<DAC2MD>
extern volatile __bit                   DAC2MD              __at(0x882);	// @ (0x110 * 8 + 2)
#define                                 DAC2MD_bit          _BIT_ACCESS(PMD4,2)
// CWG1ISM<DAT0>
extern volatile __bit                   DAT0                __at(0x3068);	// @ (0x60D * 8 + 0)
#define                                 DAT0_bit            _BIT_ACCESS(CWG1ISM,0)
// CWG1ISM<DAT1>
extern volatile __bit                   DAT1                __at(0x3069);	// @ (0x60D * 8 + 1)
#define                                 DAT1_bit            _BIT_ACCESS(CWG1ISM,1)
// CWG1ISM<DAT2>
extern volatile __bit                   DAT2                __at(0x306A);	// @ (0x60D * 8 + 2)
#define                                 DAT2_bit            _BIT_ACCESS(CWG1ISM,2)
// CWG1ISM<DAT3>
extern volatile __bit                   DAT3                __at(0x306B);	// @ (0x60D * 8 + 3)
#define                                 DAT3_bit            _BIT_ACCESS(CWG1ISM,3)
// CWG1ISM<DAT4>
extern volatile __bit                   DAT4                __at(0x306C);	// @ (0x60D * 8 + 4)
#define                                 DAT4_bit            _BIT_ACCESS(CWG1ISM,4)
// CRCDATAL<DATA0>
extern volatile __bit                   DATA0               __at(0xE4D0);	// @ (0x1C9A * 8 + 0)
#define                                 DATA0_bit           _BIT_ACCESS(CRCDATAL,0)
// CRCDATAL<DATA1>
extern volatile __bit                   DATA1               __at(0xE4D1);	// @ (0x1C9A * 8 + 1)
#define                                 DATA1_bit           _BIT_ACCESS(CRCDATAL,1)
// CRCDATAH<DATA10>
extern volatile __bit                   DATA10              __at(0xE4DA);	// @ (0x1C9B * 8 + 2)
#define                                 DATA10_bit          _BIT_ACCESS(CRCDATAH,2)
// CRCDATAH<DATA11>
extern volatile __bit                   DATA11              __at(0xE4DB);	// @ (0x1C9B * 8 + 3)
#define                                 DATA11_bit          _BIT_ACCESS(CRCDATAH,3)
// CRCDATAH<DATA12>
extern volatile __bit                   DATA12              __at(0xE4DC);	// @ (0x1C9B * 8 + 4)
#define                                 DATA12_bit          _BIT_ACCESS(CRCDATAH,4)
// CRCDATAH<DATA13>
extern volatile __bit                   DATA13              __at(0xE4DD);	// @ (0x1C9B * 8 + 5)
#define                                 DATA13_bit          _BIT_ACCESS(CRCDATAH,5)
// CRCDATAH<DATA14>
extern volatile __bit                   DATA14              __at(0xE4DE);	// @ (0x1C9B * 8 + 6)
#define                                 DATA14_bit          _BIT_ACCESS(CRCDATAH,6)
// CRCDATAH<DATA15>
extern volatile __bit                   DATA15              __at(0xE4DF);	// @ (0x1C9B * 8 + 7)
#define                                 DATA15_bit          _BIT_ACCESS(CRCDATAH,7)
// CRCDATAU<DATA16>
extern volatile __bit                   DATA16              __at(0xE4E0);	// @ (0x1C9C * 8 + 0)
#define                                 DATA16_bit          _BIT_ACCESS(CRCDATAU,0)
// CRCDATAU<DATA17>
extern volatile __bit                   DATA17              __at(0xE4E1);	// @ (0x1C9C * 8 + 1)
#define                                 DATA17_bit          _BIT_ACCESS(CRCDATAU,1)
// CRCDATAU<DATA18>
extern volatile __bit                   DATA18              __at(0xE4E2);	// @ (0x1C9C * 8 + 2)
#define                                 DATA18_bit          _BIT_ACCESS(CRCDATAU,2)
// CRCDATAU<DATA19>
extern volatile __bit                   DATA19              __at(0xE4E3);	// @ (0x1C9C * 8 + 3)
#define                                 DATA19_bit          _BIT_ACCESS(CRCDATAU,3)
// CRCDATAL<DATA2>
extern volatile __bit                   DATA2               __at(0xE4D2);	// @ (0x1C9A * 8 + 2)
#define                                 DATA2_bit           _BIT_ACCESS(CRCDATAL,2)
// CRCDATAU<DATA20>
extern volatile __bit                   DATA20              __at(0xE4E4);	// @ (0x1C9C * 8 + 4)
#define                                 DATA20_bit          _BIT_ACCESS(CRCDATAU,4)
// CRCDATAU<DATA21>
extern volatile __bit                   DATA21              __at(0xE4E5);	// @ (0x1C9C * 8 + 5)
#define                                 DATA21_bit          _BIT_ACCESS(CRCDATAU,5)
// CRCDATAU<DATA22>
extern volatile __bit                   DATA22              __at(0xE4E6);	// @ (0x1C9C * 8 + 6)
#define                                 DATA22_bit          _BIT_ACCESS(CRCDATAU,6)
// CRCDATAU<DATA23>
extern volatile __bit                   DATA23              __at(0xE4E7);	// @ (0x1C9C * 8 + 7)
#define                                 DATA23_bit          _BIT_ACCESS(CRCDATAU,7)
// CRCDATAT<DATA24>
extern volatile __bit                   DATA24              __at(0xE4E8);	// @ (0x1C9D * 8 + 0)
#define                                 DATA24_bit          _BIT_ACCESS(CRCDATAT,0)
// CRCDATAT<DATA25>
extern volatile __bit                   DATA25              __at(0xE4E9);	// @ (0x1C9D * 8 + 1)
#define                                 DATA25_bit          _BIT_ACCESS(CRCDATAT,1)
// CRCDATAT<DATA26>
extern volatile __bit                   DATA26              __at(0xE4EA);	// @ (0x1C9D * 8 + 2)
#define                                 DATA26_bit          _BIT_ACCESS(CRCDATAT,2)
// CRCDATAT<DATA27>
extern volatile __bit                   DATA27              __at(0xE4EB);	// @ (0x1C9D * 8 + 3)
#define                                 DATA27_bit          _BIT_ACCESS(CRCDATAT,3)
// CRCDATAT<DATA28>
extern volatile __bit                   DATA28              __at(0xE4EC);	// @ (0x1C9D * 8 + 4)
#define                                 DATA28_bit          _BIT_ACCESS(CRCDATAT,4)
// CRCDATAT<DATA29>
extern volatile __bit                   DATA29              __at(0xE4ED);	// @ (0x1C9D * 8 + 5)
#define                                 DATA29_bit          _BIT_ACCESS(CRCDATAT,5)
// CRCDATAL<DATA3>
extern volatile __bit                   DATA3               __at(0xE4D3);	// @ (0x1C9A * 8 + 3)
#define                                 DATA3_bit           _BIT_ACCESS(CRCDATAL,3)
// CRCDATAT<DATA30>
extern volatile __bit                   DATA30              __at(0xE4EE);	// @ (0x1C9D * 8 + 6)
#define                                 DATA30_bit          _BIT_ACCESS(CRCDATAT,6)
// CRCDATAT<DATA31>
extern volatile __bit                   DATA31              __at(0xE4EF);	// @ (0x1C9D * 8 + 7)
#define                                 DATA31_bit          _BIT_ACCESS(CRCDATAT,7)
// CRCDATAL<DATA4>
extern volatile __bit                   DATA4               __at(0xE4D4);	// @ (0x1C9A * 8 + 4)
#define                                 DATA4_bit           _BIT_ACCESS(CRCDATAL,4)
// CRCDATAL<DATA5>
extern volatile __bit                   DATA5               __at(0xE4D5);	// @ (0x1C9A * 8 + 5)
#define                                 DATA5_bit           _BIT_ACCESS(CRCDATAL,5)
// CRCDATAL<DATA6>
extern volatile __bit                   DATA6               __at(0xE4D6);	// @ (0x1C9A * 8 + 6)
#define                                 DATA6_bit           _BIT_ACCESS(CRCDATAL,6)
// CRCDATAL<DATA7>
extern volatile __bit                   DATA7               __at(0xE4D7);	// @ (0x1C9A * 8 + 7)
#define                                 DATA7_bit           _BIT_ACCESS(CRCDATAL,7)
// CRCDATAH<DATA8>
extern volatile __bit                   DATA8               __at(0xE4D8);	// @ (0x1C9B * 8 + 0)
#define                                 DATA8_bit           _BIT_ACCESS(CRCDATAH,0)
// CRCDATAH<DATA9>
extern volatile __bit                   DATA9               __at(0xE4D9);	// @ (0x1C9B * 8 + 1)
#define                                 DATA9_bit           _BIT_ACCESS(CRCDATAH,1)
// SSP1STAT<DATA_ADDRESS1>
extern volatile __bit                   DATA_ADDRESS1       __at(0x3C7D);	// @ (0x78F * 8 + 5)
#define                                 DATA_ADDRESS1_bit   _BIT_ACCESS(SSP1STAT,5)
// SSP2STAT<DATA_ADDRESS2>
extern volatile __bit                   DATA_ADDRESS2       __at(0x3CCD);	// @ (0x799 * 8 + 5)
#define                                 DATA_ADDRESS2_bit   _BIT_ACCESS(SSP2STAT,5)
// CWG1DBF<DBF0>
extern volatile __bit                   DBF0                __at(0x3078);	// @ (0x60F * 8 + 0)
#define                                 DBF0_bit            _BIT_ACCESS(CWG1DBF,0)
// CWG1DBF<DBF1>
extern volatile __bit                   DBF1                __at(0x3079);	// @ (0x60F * 8 + 1)
#define                                 DBF1_bit            _BIT_ACCESS(CWG1DBF,1)
// CWG1DBF<DBF2>
extern volatile __bit                   DBF2                __at(0x307A);	// @ (0x60F * 8 + 2)
#define                                 DBF2_bit            _BIT_ACCESS(CWG1DBF,2)
// CWG1DBF<DBF3>
extern volatile __bit                   DBF3                __at(0x307B);	// @ (0x60F * 8 + 3)
#define                                 DBF3_bit            _BIT_ACCESS(CWG1DBF,3)
// CWG1DBF<DBF4>
extern volatile __bit                   DBF4                __at(0x307C);	// @ (0x60F * 8 + 4)
#define                                 DBF4_bit            _BIT_ACCESS(CWG1DBF,4)
// CWG1DBF<DBF5>
extern volatile __bit                   DBF5                __at(0x307D);	// @ (0x60F * 8 + 5)
#define                                 DBF5_bit            _BIT_ACCESS(CWG1DBF,5)
// CWG1DBR<DBR0>
extern volatile __bit                   DBR0                __at(0x3070);	// @ (0x60E * 8 + 0)
#define                                 DBR0_bit            _BIT_ACCESS(CWG1DBR,0)
// CWG1DBR<DBR1>
extern volatile __bit                   DBR1                __at(0x3071);	// @ (0x60E * 8 + 1)
#define                                 DBR1_bit            _BIT_ACCESS(CWG1DBR,1)
// CWG1DBR<DBR2>
extern volatile __bit                   DBR2                __at(0x3072);	// @ (0x60E * 8 + 2)
#define                                 DBR2_bit            _BIT_ACCESS(CWG1DBR,2)
// CWG1DBR<DBR3>
extern volatile __bit                   DBR3                __at(0x3073);	// @ (0x60E * 8 + 3)
#define                                 DBR3_bit            _BIT_ACCESS(CWG1DBR,3)
// CWG1DBR<DBR4>
extern volatile __bit                   DBR4                __at(0x3074);	// @ (0x60E * 8 + 4)
#define                                 DBR4_bit            _BIT_ACCESS(CWG1DBR,4)
// CWG1DBR<DBR5>
extern volatile __bit                   DBR5                __at(0x3075);	// @ (0x60E * 8 + 5)
#define                                 DBR5_bit            _BIT_ACCESS(CWG1DBR,5)
// STATUS<DC>
extern volatile __bit                   DC                  __at(0x19);	// @ (0x3 * 8 + 1)
#define                                 DC_bit              _BIT_ACCESS(STATUS,1)
// CLKRCON<DC0>
extern volatile __bit                   DC0                 __at(0x14B3);	// @ (0x296 * 8 + 3)
#define                                 DC0_bit             _BIT_ACCESS(CLKRCON,3)
// CLKRCON<DC1>
extern volatile __bit                   DC1                 __at(0x14B4);	// @ (0x296 * 8 + 4)
#define                                 DC1_bit             _BIT_ACCESS(CLKRCON,4)
// CLKRCON<DIV0>
extern volatile __bit                   DIV0                __at(0x14B0);	// @ (0x296 * 8 + 0)
#define                                 DIV0_bit            _BIT_ACCESS(CLKRCON,0)
// CLKRCON<DIV1>
extern volatile __bit                   DIV1                __at(0x14B1);	// @ (0x296 * 8 + 1)
#define                                 DIV1_bit            _BIT_ACCESS(CLKRCON,1)
// CLKRCON<DIV2>
extern volatile __bit                   DIV2                __at(0x14B2);	// @ (0x296 * 8 + 2)
#define                                 DIV2_bit            _BIT_ACCESS(CLKRCON,2)
// CRCCON2<DLEN0>
extern volatile __bit                   DLEN0               __at(0xE520);	// @ (0x1CA4 * 8 + 0)
#define                                 DLEN0_bit           _BIT_ACCESS(CRCCON2,0)
// CRCCON2<DLEN1>
extern volatile __bit                   DLEN1               __at(0xE521);	// @ (0x1CA4 * 8 + 1)
#define                                 DLEN1_bit           _BIT_ACCESS(CRCCON2,1)
// CRCCON2<DLEN2>
extern volatile __bit                   DLEN2               __at(0xE522);	// @ (0x1CA4 * 8 + 2)
#define                                 DLEN2_bit           _BIT_ACCESS(CRCCON2,2)
// CRCCON2<DLEN3>
extern volatile __bit                   DLEN3               __at(0xE523);	// @ (0x1CA4 * 8 + 3)
#define                                 DLEN3_bit           _BIT_ACCESS(CRCCON2,3)
// CRCCON2<DLEN4>
